Revit 2027 API
PanelScheduleView.IsSpare Method
 Check if the circuit is a spare
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSpare(
	int nRow,
	int nCol
)
Public Function IsSpare (
	nRow As Integer,
	nCol As Integer
) As Boolean
public:
bool IsSpare(
	int nRow,
	int nCol
)
member IsSpare :
        nRow : int *
        nCol : int -> bool
Parameters
nRow Int32
 Row Number
nCol Int32
 Column Number
Return Value
Boolean
 True if the circuit is a spare, false otherwise
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace